import java.util.Scanner;

public class Esoda1 {
    public void greet() {
        System.out.println ("Δώσε τιμές στις παρακάτω κατηγορίες.");
    }

    public static void main(String[] args) {
        Esoda1 esoda = new Esoda1();
        esoda.greet();
        String[] Category = {"Φόρος εισοδήματος φυσικών προσώπων", "Φόρος εισοδήματος νομικών προσώπων", "Φόρος προστιθέμενης αξίας", "Ειδικός φόρος κατανάλωσης καυσίμων", "Ειδικός φόρος κατανάλωσης καπνού", "Ειδικός φόρος κατανάλωσης αλκοόλ", "Φόρος ακίνητης περιουσίας", "Τέλη κυκλοφορίας", "Τεκμήρια/έμμεσοι φόροι περιουσίας", "Τέλη χαρτοσήμου", "Έσοδα από κρατικές υπηρεσίες", "Πρόστιμα και κυρώσεις", "Έσοδα από παραχωρήσεις/άδειες", "Έσοδα από αποκρατικοποιήσεις", "Έσοδα από αξιοποίηση δημόσιας περιουσίας", "Ανταποδοτικά τέλη ΟΤΑ", "Κέρδη από δημόσιες επιχειρήσεις", "Τόκοι από διαθέσιμα του Δημοσίου", "Ευρωπαϊκά κονδύλια / ΕΣΠΑ" , "Δάνεια και χρηματοδοτήσεις από διεθνείς οργανισμούς"};
        int[] Values = new int[20];
        Scanner scanner = new Scanner(System.in);
        for (int i = 0; i < Values.length; i ++) {
            System.out.println(Category[i] + " -> " );
            int arith = scanner.nextInt();
            Values[i] = arith;
        }
    }

}
