import java.util.Scanner;
public class Trial1  {
    public static void main(String[] args) {
        String[] category1 = {"Φόρος εισοδήματος φυσικών προσώπων", "Φόρος εισοδήματος νομικών προσώπων", "Φόρος προστιθέμενης αξίας", "Ειδικός φόρος κατανάλωσης καυσίμων", "Ειδικός φόρος κατανάλωσης καπνού", "Ειδικός φόρος κατανάλωσης αλκοόλ", "Φόρος ακίνητης περιουσίας", "Τέλη κυκλοφορίας", "Τεκμήρια/έμμεσοι φόροι περιουσίας", "Τέλη χαρτοσήμου", "Έσοδα από κρατικές υπηρεσίες", "Πρόστιμα και κυρώσεις", "Έσοδα από παραχωρήσεις/άδειες", "Έσοδα από αποκρατικοποιήσεις", "Έσοδα από αξιοποίηση δημόσιας περιουσίας", "Ανταποδοτικά τέλη ΟΤΑ", "Κέρδη από δημόσιες επιχειρήσεις", "Τόκοι από διαθέσιμα του Δημοσίου", "Ευρωπαϊκά κονδύλια / ΕΣΠΑ" , "Δάνεια και χρηματοδοτήσεις από διεθνείς οργανισμούς"};
        int[] values1 = new int[20];
        Trial.budgetItem(category1, values1);
        String[] cat2 = {"Μισθοί δημοσίων υπαλλήλων", "Συντάξεις δημοσίου", "Επιδόματα και κοινωνικές παροχές", "Δαπάνες υγείας (νοσοκομεία, φαρμακευτική δαπάνη)", "Δαπάνες παιδείας (σχολεία, πανεπιστήμια)", "Δαπάνες για δημόσια διοίκηση", "Ασφάλεια και άμυνα (στρατός, αστυνομία)", "Δικαστικό σύστημα", "Κτιριακές υποδομές", "Οδικά έργα – αυτοκινητόδρομοι", "Σιδηροδρομικά έργα", "Ψηφιακός μετασχηματισμός / πληροφορική", "Έργα ενέργειας – ΑΠΕ", "Έργα ύδρευσης και αποχέτευσης", "Έργα πολιτικής προστασίας", 
        "Επιχορηγήσεις σε ΟΤΑ", "Επιχορηγήσεις σε νοσοκομεία/πανεπιστήμια", "Επιδοτήσεις επιχειρήσεων", "Εξυπηρέτηση δημόσιου χρέους (τόκοι)", "Αποπληρωμή χρεολυσίων"};
        int[] val2 = new int[2];
        Trial.budgetItem(cat2, val2);

        Scanner sc = new Scanner(System.in);

        do { 
           
        }
        
    }
}
