package com.progov;

public class Trial1  {
    public static void main(String[] args) {
        String[] category1 = {"Φόρος εισοδήματος φυσικών προσώπων", "Φόρος εισοδήματος νομικών προσώπων", "Φόρος προστιθέμενης αξίας", "Ειδικός φόρος κατανάλωσης καυσίμων", "Ειδικός φόρος κατανάλωσης καπνού", "Ειδικός φόρος κατανάλωσης αλκοόλ", "Φόρος ακίνητης περιουσίας", "Τέλη κυκλοφορίας", "Τεκμήρια/έμμεσοι φόροι περιουσίας", "Τέλη χαρτοσήμου", "Έσοδα από κρατικές υπηρεσίες", "Πρόστιμα και κυρώσεις", "Έσοδα από παραχωρήσεις/άδειες", "Έσοδα από αποκρατικοποιήσεις", "Έσοδα από αξιοποίηση δημόσιας περιουσίας", "Ανταποδοτικά τέλη ΟΤΑ", "Κέρδη από δημόσιες επιχειρήσεις", "Τόκοι από διαθέσιμα του Δημοσίου", "Ευρωπαϊκά κονδύλια / ΕΣΠΑ" , "Δάνεια και χρηματοδοτήσεις από διεθνείς οργανισμούς" };
        int[] values1 = new int[20];
        System.out.println("ΈΣΟΔΑ:");
        Trial.budgetItem(category1, values1);
        String[] cat2 = {"Μισθοί δημοσίων υπαλλήλων", "Συντάξεις δημοσίου", "Επιδόματα και κοινωνικές παροχές", "Δαπάνες υγείας", "Δαπάνες παιδείας", "Δαπάνες για δημόσια διοίκηση", "Ασφάλεια και άμυνα", "Δικαστικό σύστημα", "Κτιριακές υποδομές", "Οδικά έργα - αυτοκινητόδρομοι", "Σιδηροδρομικά έργα", "Ψηφιακός μετασχηματισμός / πληροφορική", "Έργα ενέργειας - ΑΠΕ", "Έργα ύδρευσης και αποχέτευσης", "Έργα πολιτικής προστασίας", 
        "Επιχορηγήσεις σε ΟΤΑ", "Επιχορηγήσεις σε νοσοκομεία / πανεπιστήμια", "Επιδοτήσεις επιχειρήσεων", "Εξυπηρέτηση δημόσιου χρέους", "Αποπληρωμή χρεολυσίων"};
        int[] val2 = new int[20];
        System.out.println("ΈΞΟΔΑ:");
        Trial.budgetItem(cat2, val2);
        int sum1 = 0;
        int sum2 = 0;
        for (int i = 0; i < 20; i++ ) {
            sum1 = sum1 + values1[i];
            sum2 = sum2 + val2[i];
        }
        System.out.println("Έσοδα = " + sum1);
        System.out.println("Έξοδα = " + sum2);

        Trial.comparison(sum1, sum2);
        
        int x = 0;
        do { 
            MenuEpilogwn.getMenu();
            int epil = CheckVariables.checkingV1();
            if (epil == 1) {
                Epiloges.getBudget(category1, values1, cat2, val2);
            } else if (epil == 2) {
                Epiloges.changeBudget(category1, values1, cat2, val2);
            } else {
                x = 1;
                System.out.println("Τερματισμός Προγράμματος"); /* θα γινει φυλλο sql για σύγκριση περσινού κρατικού υπολογισμού με τισ ιδιεσ κατηγοριες */
            }
        
        } while (x == 0);
    }
}
