package com.progov;

public class Trial1  {
    public static void main(String[] args) {
        String[] category1 = {"1. Φόρος εισοδήματος φυσικών προσώπων", "2. Φόρος εισοδήματος νομικών προσώπων", "3. Φόρος προστιθέμενης αξίας", "4. Ειδικός φόρος κατανάλωσης καυσίμων", "5. Ειδικός φόρος κατανάλωσης καπνού", "6. Ειδικός φόρος κατανάλωσης αλκοόλ", "7. Φόρος ακίνητης περιουσίας", "8. Τέλη κυκλοφορίας", "9. Τεκμήρια/έμμεσοι φόροι περιουσίας", "10. Τέλη χαρτοσήμου", "11. Έσοδα από κρατικές υπηρεσίες", "12. Πρόστιμα και κυρώσεις", "13. Έσοδα από παραχωρήσεις/άδειες", "14. Έσοδα από αποκρατικοποιήσεις", "15. Έσοδα από αξιοποίηση δημόσιας περιουσίας", "16. Ανταποδοτικά τέλη ΟΤΑ", "17. Κέρδη από δημόσιες επιχειρήσεις", "18. Τόκοι από διαθέσιμα του Δημοσίου", "19. Ευρωπαϊκά κονδύλια / ΕΣΠΑ" , "20. Δάνεια και χρηματοδοτήσεις από διεθνείς οργανισμούς" };
        double[] values1 = new double[20];
        System.out.println("\nΈΣΟΔΑ:");
        Trial.budgetItem(category1, values1);
        String[] cat2 = {"1. Μισθοί δημοσίων υπαλλήλων", "2. Συντάξεις δημοσίου", "3. Επιδόματα και κοινωνικές παροχές", "4. Δαπάνες υγείας", "5. Δαπάνες παιδείας", "6. Δαπάνες για δημόσια διοίκηση", "7. Ασφάλεια και άμυνα", "8. Δικαστικό σύστημα", "9. Κτιριακές υποδομές", "10. Οδικά έργα-αυτοκινητόδρομοι", "11. Σιδηροδρομικά έργα", "12. Ψηφιακός μετασχηματισμός/πληροφορική", "13. Έργα ενέργειας-ΑΠΕ", "14. Έργα ύδρευσης και αποχέτευσης", "15. Έργα πολιτικής προστασίας", 
        "16. Επιχορηγήσεις σε ΟΤΑ", "17. Επιχορηγήσεις σε νοσοκομεία/πανεπιστήμια", "18. Επιδοτήσεις επιχειρήσεων", "19. Εξυπηρέτηση δημόσιου χρέους", "20. Αποπληρωμή χρεολυσίων"};
        double[] val2 = new double[20];
        System.out.println("\nΈΞΟΔΑ:");
        Trial.budgetItem(cat2, val2);
        double sum1 = 0;
        double sum2 = 0;
        for (int i = 0; i < 20; i++ ) {
            sum1 = sum1 + values1[i];
            sum2 = sum2 + val2[i];
        }
        System.out.println("\nΈσοδα = " + sum1);
        System.out.println("Έξοδα = " + sum2);

        Trial.comparison(sum1, sum2);
        
        int x = 0;
        do { 
            MenuEpilogwn.getMenu();
            int epil = CheckVariables.checkingV1();
            switch (epil) {
                case 1 -> Epiloges.getBudget(category1, values1, cat2, val2);
                case 2 -> Epiloges.changeBudget(category1, values1, cat2, val2);
                case 3 -> {
                    Diagram.diagramm1(category1, values1);
                    Diagram.diagramm2(cat2, val2);
                }
                case 4 -> BudgetComparator.compare(category1, values1, cat2, val2);
                default -> {
                    x = 1;
                    System.out.println("\nΤερματισμός Προγράμματος"); 
                }
            }
        
        } while (x == 0);
    }
}
